backend/controllers/UserController.php

    public function actionCreate()
    {
        $model = new User();
        $model->password = "";

        if ($model->load(Yii::$app->request->post())) {

            if ($model->validate()){
                $model->setPassword($model->password);
                $model->generateAuthKey();

                if ($model->save())
---
INSERT INTO `user` (`firstname`, `lastname`, `username`, `email`, `role`, `status`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('dfsfs', 'dsfsdf', 'dfsdf', 'dfsfd@dfsd.evn', 10, 10, '$2y$13$ofFWu6pUxcls82knTtObe.HCe/jCcE1C3Xx15iT0N.eru8PBKVome', 'HVv5fXWFKPK3-iW4foObXQqTt_S7lSMs', '1539422244', '1539422244')