frontend/controllers/GiasuController.php

                //luu duong dan den file anh
                $giasu->anh = $pathcsdl.$giasu->fanh->baseName.'.'.$giasu->fanh->extension;
                $giasu->anhcmnd = $pathcsdl.$giasu->fanhcmnd->baseName.'.'.$giasu->fanhcmnd->extension;
                if ($giasu->save()){    //luu thong tin gia su
---
INSERT INTO `giasu` (`hoten`, `ngaysinh`, `gioitinh`, `email`, `sdt`, `matkhau`, `diachi`, `cmnd`, `svtruong`, `gvtruong`, `nganhhoc`, `luongyeucau`, `anh`, `anhcmnd`) VALUES ('34', '53', 533, '4534', '453', '34534', '', '', '', '', '', '', 'http://giasu.com/uploads/giasu/31841473_825447377625524_626850399541788672_n.jpg', 'http://giasu.com/uploads/giasu/31791624_825447954292133_79227509362655232_n.jpg')