frontend/views/lopday/searchlopday.php


            <div class="form-group">
              <?php
                $dataHuyen = Khuvuc::find()->asArray()->all();
---
SELECT * FROM `khuvuc`

            </div>

            <div class="form-group">
                <?php $dataCH = Caphoc::find()->asArray()->all(); ?>
---
SELECT * FROM `caphoc`

            </div>

            <div class="form-group">
                <?php $dataMH = Monhoc::find()->asArray()->all(); ?>
---
SELECT * FROM `monhoc`