backend/models/District.php

SELECT * FROM `district` WHERE provinceid=51
---
    function getHuyenByTinhId($id){
        $data = District::find()->asArray()->where('provinceid=:pid', ['pid' => $id])->all();