backend/models/Loaibds.php

    public function getAllLoaibds(){
        $data = Loaibds::find()->asArray()->all();
---
SELECT * FROM `loaibds`