backend/models/User.php

SELECT * FROM `user` WHERE (`username`='admin') AND (`role`=20)
---
    public static function isUserAdmin($username)
    {
         if (static::findOne(['username' => $username, 'role' => self::ROLE_ADMIN])){