backend/models/Ward.php

    function getXaByHuyenId($id){
        $data = Ward::find()->asArray()->where('districtid=:did', ['did'=>$id])->all();
---
SELECT * FROM `ward` WHERE districtid=NULL