frontend/models/Caphoc.php

SELECT * FROM `caphoc`
---
    function getAll(){
        $data = Caphoc::find()->asArray()->all();