frontend/models/Khuvuc.php

SELECT * FROM `khuvuc`
---
    function getAll(){
        $data = Khuvuc::find()->asArray()->all();