frontend/models/Loaibds.php

    public function getAllLoaibds(){
        return Loaibds::find()->asArray()->all();
---
SELECT * FROM `loaibds`