frontend/models/Lopday.php

SELECT * FROM `lopday` WHERE `trangthai`=0 LIMIT 20
---
    public function getLopmoi($max){
        return Lopday::find()->where(['trangthai' => 0])->limit($max)->all();;

SELECT * FROM `lopday` WHERE `trangthai`=0
---
    public function timkiem($kv, $ch, $mh){ //0: khu vuc, 1: cap hoc, 2: mon hoc
         $sql = Lopday::find()->where(['trangthai' => 0]);
         if (!empty($kv)){
            $sql->andWhere(['khuvuc_id' => $kv]);
         }
         if (!empty($ch)){
            $sql->andWhere(['caphoc_id' => $ch]);
         }
         if (!empty($mh)){
            $sql->andWhere(['monhoc_id' => $mh]);
         }

         $data = $sql->all();