frontend/models/Monhoc.php

    function getAll(){
        $data = Monhoc::find()->asArray()->all();
---
SELECT * FROM `monhoc`