frontend/widgets/views/TrangchusearchWidget.php

SELECT * FROM `district` WHERE provinceid=51
---

                    <div class="form-group">
                      <?php
                        $dataHuyen = District::find()->asArray()->where('provinceid=51')->all();

SELECT * FROM `loaibds`
---
                    </div>

                    <div class="form-group">
                        <?php $dataLoai = Loaibds::find()->asArray()->all(); ?>

SELECT * FROM `loaibds`
---
                    </div>

                    <div class="form-group">
                        <?php $dataLoai = Loaibds::find()->asArray()->all(); ?>